#include<iostream>

using namespace std;

/**
 * 数组：
 * 一段连续的内存地址；
 * 
 * 1. 如何声明数组 :int a[][];
 * 2. 如何获取数组元素: a[0][0]
 * 3. 数组的指针: int* point = a 或 int* point = &a[0][0]
 * 4. 如何使用数组: 先取再用
 * 
 * 二维数组
 * a[i][j]  i是行 j是列
*/
int main(){
    //二维数组定义使用

    //声明方式1
    int ab[][3] = {1,2,3,1,34,32,34};//3表示列，也就是 每3列为一行
    // 声明方式2
    int ab2[2][3]={
        {1,3,4},
        {2,34,5}
    };

    //使用
    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            cout<<"当前元素是："<<ab[i][j]<<endl;
        }
        
    }

    //二维数组占用内存空间
    cout<<"二维数组占用内存空间"<<sizeof(ab)<<endl;
    
    //二维数组第一行地址
    cout<<"二维数组第一行地址:"<<ab[0][0]<<endl;

    //二维数组第二行地址
    cout<<"二维数组第二行地址:"<<ab[0][1]<<endl;

    //二维数组指针
    cout<<"方式1: 二维数组指针首地址:"<<&ab[0][0]<<endl;
    cout<<"方式2: 二维数组指针首地址:"<<ab<<endl;
}