#include <iostream>
using namespace std;


/**
 * 算术运算符内容简单，不多赘述，只罗列下符号、运算规则 
 * 
 *  算术运算符:
 *  + 加
 *  - 减
 *  * 乘
 *  / 除
 *  +(正号)
 *  -(负号)
 *  % 取模（又叫取余）
 *  ++ 递增
 *  -- 递减
*/

int main(){
    int a = 13,b = 10;

    cout<<a + b<<endl;
    cout<<a - b<<endl;
    cout<<a * b<<endl;
    cout<<a / b<<endl;//1.两数相除，除数不能为0（会报错）；2.两数相除，结果取商，会忽略余数（余数有专门符号%）；3.两数相除运算结果可以是小数

    cout<<+a<<endl;
    cout<<-a<<endl;


     cout<<a % b<<endl; // 1、结果: 13 % 10 = 1 ... 3， 结果就是余数 3；2、取模基于除法，所以除数不能为0 ；3、两个小数不能取余运算，必须有整数


     a++;//后置递增
     ++b;//前置递增

    a--;//后置递减
    --b;//前置递减

   //注意！
   cout<< a++ / b<<endl;//后置递增或递减，先参与其他运算，然后自身再递增或递减
   cout<<--a/b<<endl;//前置递增或递减，先自身递增或递减，后参与其他运算
}